{
  "theme":       "default",
  "name":        "Benjamin J. Schreck",
  "bio":         "Ben for short. Deeply experienced in end-to-end data science using Python, but I consider myself a generalist. Deeply excited about autonomy and cryptocurency (disjointly). Standing up out of chairs whenever possible. Keeping beginner's mind as best as I can.",
  "description": "Detailed description for search engines.",
  "host":        "https://bschreck.github.io",
  "analytics":   "<script type='text/javascript'></script>",
  "feeds": [
    { "type": "application/atom+xml", "url": "<%= host %>/blog/feed.atom"},
    { "type": "application/rss+xml",  "url": "<%= host %>/blog/feed.rss"}
  ],
  "links": [
    { "name": "LinkedIn", "type": "symbol", "symbol": "&#xe252;", "url": "https://www.linkedin.com/in/benschreck" },
    { "name": "GitHub", "type": "symbol", "symbol": "&#xe237;", "url": "http://www.github.com/bschreck" },
    { "name": "Stack Overflow", "type": "image", "image": "https://stackoverflow.com/users/flair/2002890.png", "url": "https://stackoverflow.com/users/2002890/bschreck"},
    { "name": "Gitlab", "type": "image", "image": "/gitlab_logo.svg",  "url": "https://gitlab.com/users/bschreck" }
  ],
  "pages": [
    { "name": "Work Experience", "url": "/work-experience", "visible": true,
      "items": [
      {"name": "Feature Labs",
       "image": "/featurelabs-logo.jpg",
       "years": "2016 - 2018",
       "title": "Co-Founder & Chief Data Scientist",
       "url": "https://featurelabs.com",
       "items": [
          {
            "name": "Purpose & History",
            "subitems": [
              "Feature Labs spun out of MIT’s Data-to-AI (DAI) lab to solve a problem we kept seeing: medium to large enterprises were unable to build and deploy machine learning models"
            ]
          },
          {
            "name": "Responsibilities",
            "subitems": [
              "Helped lead ~10 person team, including mentoring less experienced members",
              "Marketed and sold enterprise software products",
              "Worked with remote contractors and partners across the world.",
              "Architected and developed enterprise and open-source software products. Scalable to data size (from large: terabytes to small: kilobytes) and complexity (worked with hundreds of columns, tens of tables, all data types)",
              "Developed tutorials, demos, blogs, and other learning materials",
              "Developed novel data science techniques & software, for feature selection, feature engineering, automation, data ingestion, working with multimodal data, dealing with the time dimension, fusing deep learning and traditional machine learning techniques, and catering to non-technical users through UI",
              "Gave demos to potential customers",
              "Helped raise venture capital",
              "Contributed significant work to our team's entry into the DARPA D3M program/competition. This included building core primitives and automation software (see <a href='/projects'>Projects</a> tab), interfacing with our team members at MIT (led by <a href='https://people.csail.mit.edu/saman/'>Prof. Saman Amarasinghe</a>), interfacing with other D3M teams who developed primitives or UIs, contributing to shared code (see <a href='/open-source-contributions'>Open Source</a>), and giving presentations.",
              "Core contributor to our open-source product <a href='https://github.com/featuretools/featuretools' >Featuretools, the most popular feature engineering library on Github</a>. See <a href='/projects'>Projects</a> for more details."
            ]
          },
          {
            "name": "Core Product",
            "subitems": [
              "Enterprise-ready end-to-end backend system and UI for predictive analytics to be used concurrently by multiple developers and subject-matter experts at corporations",
              "Deployment either on customer's private cloud or on AWS",
              "<a href='https://www.featurelabs.com/blog/what-is-ml-2-0/'><it>ML 2.0</it></a> workflow for deployment-focused machine learning (I had a lead role in first deployment, at Accenture)",
              "Novel feature engineering techniques for working with time-based, relational datasets, which could be small or large, multimodal, and complex.",
              "Novel techniques for dealing with the <it>time</it> dimension to increase confidence and deployment accuracy",
              "<it>Prediction Engineering</it> as a new data science abstraction, for an overview see <a href='https://featurelabs1.wpengine.com/wp-content/uploads/2017/12/Trane1.pdf'>my paper</a> and <a href='https://www.youtube.com/watch?v=TrK5Tm9ic28'>video</a>",
              "Successfully scaled to large data sets and multiple simultaneous users by partitioning and processing in parallel across cores & machines.",
              "Successfully trained customers' software engineers with no or very little prior machine learning experience to develop their own complex predictive models"
            ]
          },
          {
            "name": "Revenue/Funding",
            "subitems": [
              "Raised $1.5 MM in seed funding from Flybridge Capital",
              "Bootstrapped for first year from customers",
              "Sold 6-figure annual software licenses",
              "Significant recurrent funding from DARPA D3M program"
            ]
          },
          {
            "name": "Programs/Partnerships/Customers",
            "info": "These are some of Feature Labs' publicly disclosed programs & customers, or users of software produced by Feature Labs.",
            "subitems": [
              {"name": "DARPA D3M", "logo": "/darpa.jpeg", "url": "https://www.darpa.mil/program/data-driven-discovery-of-models"},
              {"name": "MIT STEX25", "logo": "/stex.png", "url": "http://startupexchange.mit.edu/startupexchange/html/index.html#stex25"},
              {"name": "BBVA", "logo": "/bbva.png", "url": "https://www.bbva.com/en/us/"},
              {"name": "Accenture", "logo": "/accenture.jpeg", "url": "https://www.accenture.com"}
            ]
          },

          {
            "name": "Blog Posts (of which I am an author)",
            "subitems": [
              {"year": 2018, "name": "Getting Value From Machine Learning Isn't About Fancier Algorithms - It's About Making It Easier to Use", "url": "https://hbr.org/2018/03/getting-value-from-machine-learning-isnt-about-fancier-algorithms-its-about-making-it-easier-to-use"},
              {"year": 2018, "name": "What Is ML 2.0", "url": "https://www.featurelabs.com/blog/what-is-ml-2-0/"},
              {"year": 2018, "name": "Feature Engineering vs. Feature Selection", "url": "https://www.featurelabs.com/blog/feature-engineering-vs-feature-selection/"},
              {"year": 2017, "name": "Predicting Credit Card Fraud", "url": "https://www.featurelabs.com/blog/predicting-credit-card-fraud/"}
            ]
          }
        ]
       }
      ]
    },
    { "name": "Education", "url": "/education", "visible": true,
          "school": "Massachusetts Institute of Technology",
          "masters_year": 2016,
          "masters_degree": "<b>M.Eng.</b> Electrical Engineering and Computer Science",
          "masters_concentration": "Artificial Intelligence",
          "masters_thesis": "Towards an Automatic Predictive Question Formulation",
          "undergrad_year": 2015,
          "undergrad_degree": "<b>S.B.</b> Electrical Engineering and Computer Science",
          "logo": "/mit.png",
          "years": "2011-2016"
    },
    { "name": "Projects", "url": "/projects", "visible": true ,
      "items": [
        {
          "name": "Featuretools",
          "subtitle": "Feature engineering in Python",
          "image": "/featuretools-logo.png",
          "description": "Provides a language to express complex, composable features on top of relational time-varying data, an efficient multithreaded engine to compute these features at particular points in time (scalable to clusters using Dask or PySpark), and algorithms for automatically generating the list of features (e.g. Deep Feature Synthesis). I was the first user, a lead developer since 2016, and helped in its transition from closed to open source in 2017.",
          "url": "https://github.com/Featuretools/featuretools/commits?author=bschreck",
          "contributors": "Many, see 'contributors' tab on Github (click this card to go to the Github repository).",
          "date": "2016-2018",
          "recognition": "Most popular feature engineering library on Github with over 2400 stars as of November 2018. Stack Overflow tag."
        },
        {
          "name": "AI Project Manager",
          "subtitle": "Deployed Predictive Analytics for Large Software Projects (collab. with Accenture)",
          "image": "/aipm.jpg",
          "description": "<ul><li>Multi-year effort to deploy a system at Accenture that augments project managers by predicting the degree to which projects' future metrics will be on target.</li><li>Developed deployment-focused machine learning workflow that translated to many other projects at Feature Labs.</li><li>Succesfully deployed, continually tested, and periodically updated by Accenture engineers since September 2018.</li><li>Knowledge transfer of necessary machine learning concepts and skills to novice engineers at Accenture Bangalore.</li><li>One of first machine learning projects actually used internally at Accenture.</li></ul>",
          "url": "https://www.featuretools.com/wp-content/uploads/2018/03/AIPM.pdf",
          "contributors": "Kalyan Veeramachaneni (MIT & Feature Labs), Sarvesh Damle (Accenture), Rajendra Prasad (Accenture), Shankar Mallapur (Accenture)",
          "date": "2015-2018",
          "recognition": "Published in IEEE Big Data 2018. Deployed at Accenture."
        },
        {
            "name": "DARPA D3M TA2 System",
            "subtitle": "",
            "image": "/darpa.jpeg",
            "description": "D3M (Data-Driven Discovery of Models) is a multiyear 25+MM project/competition. TA2 systems automatically solve image, audio, text, tabular, relational, time-series, graph, recommendation, and other data science problems. They also interface with TA1 components (data science primitives) and TA3 systems (UIs). Our entry used open-source tools we developed such as [GET LINKS] MLBlocks (automatic pipeline generation), Featuretools (feature engineering system), and BTB (copula-based hyperparameter optimizer). We consistently handled all dataset types. I contributed heavily to our handling of image, text, relational, time-series, graph, & recommendation problems, and integrating with TA1 primitives. Note: system not public. Link redirects to D3M Gitlab page.",
            "url": "https://gitlab.com/datadrivendiscovery",
            "contributors": "Members of Feature Labs and the MIT Data-to-AI Lab, along with Carles Sala.",
            "date": "2017-2018",
            "recognition": "Consistently in top 2 at integration events, depending on metric, while I was a member"
        },
        {
            "name": "DARPA D3M TA1 Primitives",
            "subtitle": "",
            "image": "/darpa.jpeg",
            "description": "D3M (Data-Driven Discovery of Models) is a multiyear 25+MM project/competition. TA1 primitives are individual data science components that can be accessed by TA2 and TA3 systems. I was the lead developer of our TA1 entries, including a primitive for applying Featuretools and Random Forest-based feature selection. I also helped debug JPL's Scikit-Learn (CHECK SPELLING) primitives.",
            "url": "https://github.com/Featuretools/ta1-primitives",
            "contributors": "Members of Feature Labs and the MIT Data-to-AI Lab, along with Carles Sala.",
            "date": "2017-2018",
            "recognition": ""
        },
        {
            "name": "Lil Neuron",
            "subtitle": "NLP Lyric Generation",
            "image": "",
            "description": "Recurrent neural networks trained on rap lyrics. Used a novel method incorporating word pronunciations to embed rhyme schemes. See Blog tab for more details [NEED TOP ADD LINKS TO THESE]",
            "url": "https://github.com/bschreck/lil-neuron",
            "contributors": "",
            "date": "2016-2017",
            "recognition": "AI Grant Finalist"
        },
        {
          "name": "DLDB",
          "subtitle": "Deep Learning for Databases",
          "image": "/dldb_fig.png",
          "description": "High-level API to apply deep learning to tabular data. incorporates cutoff times to preserve label leakage. Automatically embeds sparse categorical variables into a dense numeric representation. Parameterized architecture allows interoperability with Keras. Several demos available <a href='https://github.com/Featuretools/DLDB-Demos'>here</a>.",
          "url": "https://github.com/Featuretools/DL-DB",
          "contributors": "Kalyan Veeramachaneni",
          "date": "2018",
          "recognition": ""
        },
        {
            "name": "Personal Food Computer",
            "subtitle": "Hydroponic vegetable & herb growing system",
            "image": "/pfc.jpg",
            "description": "This is inspired by the MIT Media Lab Open Agriculture Project, and specifically a low-cost version discussed on an associate forum. I use several devices (such as a Raspberry Pi) to measure and control variables like temperature & humidity. Eventually I want to see how many variables I can automate and control.",
            "url": "https://www.media.mit.edu/posts/build-a-food-computer",
            "contributors": "",
            "date": "2018",
            "recognition": ""
        },
        {
          "name": "Predicting Malicious Cyber Connections",
          "subtitle": "Featuretools demo for MIT Lincoln Labs.",
          "url": "https://github.com/Featuretools/predict-malicious-cyber-connections",
          "image": "/featuretools-logo.png",
          "description": "Applies Featuretools to cybersecurity dataset to build features and predict malicious web traffic in advance",
          "contributors": "",
          "date": "2018",
          "recognition": ""
        },
        {
          "name": "Trane",
          "subtitle": "A Language to Express Predictive Problems (Part of Master's Thesis)",
          "url": "https://github.com/HDI-Project/Trane",
          "image": "https://dai.lids.mit.edu/wp-content/uploads/2018/06/Trane-logo-300x180.jpg",
          "description": "Reminiscent of one late, great jazz saxophonist, this project allows anyone (including machines) to improvise over data. It includes a novel language to express <i>prediction problems</i> over datasets, and an interpreter to convert those problems into code. In my thesis, I used an early version of Featuretools in combination with Scikit-Learn to automatcally generate and solve thousands of these problems. While I am no longer actively contributing work is ongoing with current students in the MIT Data-to-AI lab. Note that Github link is the most recent repository, which was heavily refactored from my original work and thus does not show my contributions directly. Please click the card to see the published paper.",
          "contributors": "Kalyan Veeramachaneni, Alex Nordin, Lei Xu, & Albert Carter",
          "date": "2016",
          "recognition": "Published in IEEE DSAA 2016"
        },
        {
          "name": "Pernican",
          "subtitle": "A machine learning system to recommend meaningful prediction problems depending on the dataset and user (Part of Master's Thesis)",
          "url": "",
          "image": "/dailab.png",
          "description": "Recommender system to learn and suggest <i>meaningful</i> prediction problems from arbitrary datasets. I developed a system that translate Trane problems into human-readable sentences, and a UI that allows humans to rank randomly generated problems based on how meaningful they think they are. Pernican uses these rankings as labeled data and generates features from each dataset. Features include statistical information about the dataset, as well as semantic clusters using Word2Vec topic models on the names of columns. It also generates an exhaustive list of possible prediction problems using a subset Trane. This is nontrivial because datasets have different numbers of columns and different numbers of possible prediction problems. Finally, the system uses both implicit low-rank matrix features as well as explicit extracted features to rank each possible prediction problem and return an ordered list. Users can provide feedback and the system will update its internal model. Note: project showed promising early results but needed more data to reach strong conclusions. Note: url not provided because project is not currently public",
          "contributors": "Kalyan Veeramachaneni",
          "date": "2016",
          "recognition": ""
        },
        {
          "name": "Online Matrix Prediction Implementation",
          "subtitle": "Final project for MIT 6.883 Online Methods in Machine Learning",
          "url": "https://github.com/bschreck/near-optimal-online-matrix-prediction",
          "image": "",
          "description": "Implemented a theoretically near-optimal online algorithm in Julia and Python to predict unknown values in a matrix according to a low local-trace norm heuristic.",
          "contributors": "",
          "date": "2016",
          "recognition": "Open Source Contribution: first implementation of algorithm"
        },
        {
          "name": "Robo-Chef",
          "subtitle": "NLP Recipe Suggestions",
          "url": "https://github.com/bschreck/robo-chef",
          "image": "",
          "description": "Using an attention-based recurrent neural network, built a system that gathered recipes and associated comments from websites, isolated refinements within comments and placed them within the referenced location in the recipe text.",
          "contributors": "Nico Rakover, Ambika Krishnamachar",
          "date": "2015",
          "recognition": ""
        },
        {
          "name": "Scenic-Recursion",
          "subtitle": "Computer Vision Scene Detection",
          "url": "https://github.com/bschreck/scenic-recursion",
          "image": "",
          "description": "Combined convolutional neural networks and recurrent neural networks to identify objects in scenes. Discovered a bug in Tensor Flow's data input feeders that did not sort inputs correctly (see these Stack Overflow questions: {GET LINKS}). Note: project unfinished because Tensor Flow lacked implementations for several gradient update steps I needed for backpropagation. I did not have time in the final weeks of the semester to implement these.",
          "contributors": "",
          "date": "2015",
          "recognition": "Open Source Contribution: Tensor Flow"
        },
        {
          "name": "Gesture-controlled quadcopter using FPGA & Kinect",
          "subtitle": "Final project for MIT 6.111 Digital System Lab",
          "url": "https://github.com/bschreck/gesture-drone",
          "image": "/gesture_drone.png",
          "description": "Built a gesture-controlled FPGA-based quadcopter system, where users hand movements were translated into controls through a Microsoft Kinect and an FPGA and remotely sent to a quadcopter. Video available <a href='https://www.youtube.com/watch?v=dd0SS1pb_2U'>here</a>.",
          "contributors": "Lee Gross",
          "date": "2014",
          "recognition": "Recognition: MIT EECS Northern Telecom/BNR Project Award for Best Undergraduate Laboratory Project"
        },
        {
          "name": "MOOCdb: Data Science Foundry for MOOCs",
          "subtitle": "",
          "url": "https://github.com/MOOCdb",
          "image": "/dailab.png",
          "description": "System to allow many different courses and educational providers to generate high-level features for their MOOC data and predict student dropout at any phase in the course.",
          "contributors": "Sebastien Boyer, Ben Gelman, Kalyan Veeramachaneni.",
          "date": "2015",
          "recognition": "Published in IEEE DSAA 2015"
        },
        {
          "name": "Anti-Coordination of Multiple Smart Agents Around a Simple Signal",
          "subtitle": "Final project for MIT 16.412j Cognitive Robotics",
          "url": "https://github.com/bschreck/ez-anti-coordination",
          "image": "",
          "description": "Implementation for Arduino-based agents of <a href='https://arxiv.org/pdf/1402.0583.pdf'>this</a> paper for Arduino-based agents.",
          "contributors": "Lee Gross, Matthew Susskind",
          "date": "2015",
          "recognition": ""
        },
        {
          "name": "Multicore, multilevel cache, branch-predicting, pipelined processor",
          "subtitle": "Final project for MIT 6.175 Constructive Computer Architecture",
          "url": "",
          "image": "",
          "description": "Implemented in Bluespec on an FPGA",
          "contributors": "",
          "date": "2014",
          "recognition": ""
        },
        {
          "name": "Scheduling for Liquid-Handling Robot Automation",
          "subtitle": "Project for MIT SuperUROP program in the Weiss Lab for Synthetic Biology",
          "url": "https://bitbucket.org/jbabb/biocad/src/default/",
          "image": "/weiss-lab.gif",
          "description": "Developed a scheduling system to automate wet lab research using operating systems principles to execute multiple tasks concurrently on liquid-handling robots. Developed user-facing front-end for biologists",
          "contributors": "Jonathan Babb, Felix Sun",
          "date": "2014",
          "recognition": "Publication: IWBDA 2014"
        }
      ]},
    { "name": "Blog",     "url": "/blog",         "visible": true },
    { "name": "Open Source", "url": "/open-source-contributions", "visible": true,
      "items": [{
          "name": "Featuretools",
          "url": "https://github.com/Featuretools/featuretools/commits?author=bschreck",
          "image": "/featuretools-logo.png",
          "description": "Core contributor. See Projects tab for more information."
        },
        {
          "name": "Dask/Distributed",
          "url": "https://github.com/dask/distributed/commits?author=bschreck",
          "image": "/dask.png",
          "description": "Distributed computation in Python. Provided several bug fixes and feature implementations."
        },
        {
          "name": "Dask-EC2",
          "url": "https://github.com/dask/dask-ec2/commits?author=bschreck",
          "image": "/dask.png",
          "description": "Automatic deployment of Dask program to Amazon EC2 cluster. Several commits."
        },
        {
          "name": "D3M",
          "url": "https://gitlab.com/datadrivendiscovery",
          "image": "/darpa.jpeg",
          "description": "Central storage location for shared D3M code. Implemented features & bug fixes, posted issues in multiple repositories."
        },
        {
          "name": "Pandas",
          "url": "https://github.com/pandas-dev/pandas/issues/12430",
          "image": "/pandas-logo.png",
          "description": "Data processing in Python. Proposed Cython-optimized versions of expanding aggregation functions (which I had implemented locally)."
        },
        {
          "name": "Tensor Flow",
          "url": "https://stackoverflow.com/search?q=user%3A2002890+tensorflow",
          "image": "/tensorflow.png",
          "description": "Neural networks in Python and C++. Early after the initial release, I posted an issue about a bug/feature request on Github, and asked/resolved several fundamental questions on Stack Overflow."
        },
        {
          "name": "Cvxpy",
          "url": "https://github.com/cvxgrp/cvxpy/issues/278",
          "image": "",
          "description": "Convex optimization in Julia. Proposed a feature to allow matrix versions of the exponential and logarithm operators. Started implementation but did not get around to finishing it."
        },
        {
          "name": "Convex.jl",
          "url": "https://github.com/JuliaOpt/Convex.jl/issues/138",
          "image": "",
          "description": "Convex optimization in Julia. Proposed a feature to allow matrix versions of the exponential and logarithm operators. Started implementation but did not get around to finishing it."
        },
        {
          "name": "Wikitable2CSV",
          "url": "https://github.com/gambolputty/wikitable2csv/pull/6",
          "image": "",
          "description": "Converts Wikipedia tables into CSV files. Several commits"
        },
        {
          "name": "Dask/fastparquet",
          "url": "https://github.com/dask/fastparquet/issues?utf8=%E2%9C%93&q=is%3Aissue+bschreck",
          "image": "/dask.png",
          "description": "Python Parquet filetype reader/writer. Found bugs which led to changes in master branch"
        },
        {
          "name": "MLBlocks",
          "url": "https://github.com/HDI-Project/MLBlocks",
          "image": "/mlblocks.png",
          "description": "While I didn't explicitly contribute code, I contributed ideas about architecture and the way the system learns."
        },
        {
          "name": "HDI Model Provenance Json Metadata",
          "url": "https://github.com/HDI-Project/model-provenance-json",
          "image": "/hdi.jpeg",
          "description": "A specification for the construction of a model provenance file that keeps track of the journey from raw data to deployed model in Machine Learning 2.0 projects."
        },
        {
          "name": "HDI Trane",
          "url": "https://github.com/HDI-Project/Trane",
          "image": "/trane.jpeg",
          "description": "Language to express prediction problems. Did not directly contribute code to latest version on Github, but original work was part of my master's thesis and led to a publication. See <a href='/projects'>Projects</a> for more details."
        },
        {
          "name": "Predicting Malicious Cyber Connections",
          "url": "https://github.com/Featuretools/predict-malicious-cyber-connections",
          "image": "/featuretools-logo.png",
          "description": "Applies Featuretools to cybersecurity dataset to build features and predict malicious web traffic in advance."
        },
        {
          "name": "MOOCdb",
          "url": "https://github.com/MOOCdb",
          "image": "/dailab.png",
          "description": "Data Science Foundry for MOOCS. Works across educational MOOC providers to generate complex features that can be used, for instance, to predict dropout."
        }
      ]
    },
    {"name": "Publications & White Papers", "url": "/publications", "visible": true,
      "items": [
        {
          "title": "The AI Project Manager",
          "abstract": "In this paper we describe a system to augment human project managers of large scale software projects by predicting future SLA violations, using a machine learning approach. We detail the way we collected, processed, and formatted the data from a much larger database ill-suited for the problem at hand. We then detail how we extracted training examples through prediction engineering, as well as our semi-automated feature engineering approach. Our system was able to achieve a false positive rate of .311, compared to a non-machine learning baseline of and a simple machine learning baseline without feature engineering scoring .689 and .723 respectively...",
          "publication": "IEEE International Conference on Big Data",
          "image": "/bigdata2018.jpg",
          "year": "2018",
          "authors": "Benjamin Schreck, Shankar Mallapur, Sarvesh Damle, Nitin John James, Sanjeev Vohra, Rajendra Prasad, Kalyan Veeramachaneni",
          "link": "https://www.featuretools.com/wp-content/uploads/2018/03/AIPM.pdf",
          "video": ""
        },
        {
          "title": "Machine learning 2.0: Engineering data driven AI products",
          "authors": "Max Kanter, Benjamin Schreck, Kalyan Veeramachaneni",
          "publication": "",
          "year": "2018",
          "abstract": "In this paper, we propose a paradigm shift from the current practice of creating machine learning models that requires months-long discovery, exploration and “feasibility report” generation, followed by re-engineering for deployment, in favor of a rapid 8 week long process of development, understanding, validation and deployment that can executed by developers or subject matter experts (non-ML experts) using reusable APIs. It accomplishes what we call a “minimum viable data-driven model,” delivering a ready-to-use machine learning model for problems that haven’t been solved before using machine learning…",
          "link": "https://www.featuretools.com/ml20paper",
          "video": ""
        },
        {
          "title": "What would a data scientist ask? Automatically formulating and solving prediction problems",
          "authors": "Benjamin Schreck, Kalyan Veeramachaneni",
          "publication": "IEEE International Conference on Data Science and Advanced Analytics",
          "year": "2016",
          "abstract": "In this paper, we designed a formal language, called Trane, for describing prediction problems over relational datasets, implemented a system that allows data scientists to specify problems in that language. We show that this language is able to describe several prediction problems and even the ones on Kaggle- a data science competition website. We express 29 different Kaggle problems in this language. We designed an interpreter, which translates input from the user, specified in this language, into a series of transformation and aggregation operations…",
          "link": "https://featurelabs1.wpengine.com/wp-content/uploads/2017/12/Trane1.pdf",
          "video": "https://www.youtube.com/watch?v=TrK5Tm9ic28"
        },
        {
          "title": "Data Science Foundry for MOOCs",
          "authors": "Sebastien Boyer, Ben U. Gelman, Benjamin Schreck, Kalyan Veeramachaneni.",
          "publication": "IEEE International Conference on Data Science and Advanced Analytics",
          "year": "2015",
          "abstract": "In this paper, we present the concept of data science foundry for data from Massive Open Online Courses. In the foundry we present a series of software modules that transform the data into different representations. Ultimately, each online learner is represented using a set of variables that capture his/her online behavior. These variables are captured longitudinally over an interval. Using this representation we then build a predictive analytics stack that is able to predict online learners behavior as the course progresses in real time. To demonstrate the efficacy of the foundry, we attempt to solve an important prediction problem...",
          "link": "https://ieeexplore.ieee.org/document/7344825",
          "video": ""
        },
        {
          "title": "Better Scheduling Software and User Interface for Liquid-Handling Robots",
          "abstract": "This paper outlines the design of a software system that enhances the workflow eficiency and usability of a liquid- handling robot for executing wet lab protocols, with a focus on synthetic biology. The system we propose builds on the BioCAD software suite...",
          "authors": "Benjamin Schreck, Jonathan Babb and Ron Weiss",
          "publication": "6th International Workshop on Bio-Design Automation",
          "year": "2014",
          "link": "http://www.iwbdaconf.org/2014/program/IWBDA_2014_Proceedings.pdf",
          "video": ""
        }
      ]
    },
    { "name": "Public Speaking", "url": "/public-speaking", "visible": true,
      "items": [{
          "talkname": "MIT ILP Innovation Symposium with Wuxi",
          "location": "Wuxi, China",
          "date": "2018",
          "image": "/mitilp.png",
          "description": "Presented Feature Labs' mission/goals to Chinese business leaders & government officials"
        },
        {
          "talkname": "DARPA D3M Integration Event",
          "location": "Arlington, VA",
          "date": "2018",
          "image": "/darpa.jpeg",
          "description": "Presented Feature Labs/MIT team's system"
        },
        {
          "talkname": "DARPA D3M Integration Event",
          "location": "Arlington, VA",
          "date": "2017",
          "image": "/darpa.jpeg",
          "description": "Presented Feature Labs/MIT team's system"
        },
        {
          "talkname": "DSAA Conference",
          "location": "Montreal, Canada",
          "date": "2016",
          "image": "/dsaa2016.jpg",
          "description": "Presented conference paper"
        },
        {
          "talkname": "DSAA Conference",
          "location": "Paris, France",
          "date": "2015",
          "image": "/dsaa2015.jpg",
          "description": "Presented conference paper"
        },
        {
          "talkname": "IWBDA",
          "location": "Boston, MA",
          "date": "2014",
          "image": "/iwbda2014.png",
          "description": "Presented workshop paper"
        }]
    },
    { "name": "Technical Skills", "url": "/hard-skills", "visible": true,
      "items": [
        {
          "name": "Languages/Technologies",
          "listing": [
              "Python",
              "C/C++",
              "Javascript",
              "Julia",
              "Ruby",
              "Pandas",
              "Scikit-Learn",
              "Tensor Flow",
              "Dask",
              "AWS",
              "SQL",
              "MongoDB",
              "Node.js",
              "Unix/Linux",
              "Docker"
          ]
        },

        {
          "name": "Concepts",
          "listing": [
            "Data Science (fresh)",
            "Feature Engineering (fresh)",
            "Machine Learning, Including AutoML (fresh)",
            "Machine Learning 2.0: Deployment-focused ML (fresh)",
            "Computer Vision (fresh)",
            "Natural Language Processing (fresh)",
            "Deep Neural Networks, Both Recurrent And Convolutional (fresh)",
            "Enterprise Sales (fresh)",
            "Distributed Systems And Parallel Processing (fresh)",
            "Outsourcing (fresh)",
            "Operating Systems (fresh-ish)",
            "Performance Engineering (stale-ish)",
            "Embedded Systems (stale)",
            "Planning (stale)",
            "Online Algorithms (stale)",
            "Computer Architecture (stale)",
            "Signal Processing And Control (stale)",
            "Theory Of Computation (stale)"
          ]
        }
      ]
    },
    { "name": "Non-Technical Skills", "url": "/soft-skills", "visible": true,
      "items": [{
          "name": "Discipline, Risk, Stress & Adrenaline Management",
          "experience": [
            "<b>Consistent meditation practice.</b> Many multiday retreats, and two half-hour sessions each day. Started seriously practicing in college.",
            "<b>High-level competitive sports.</b> Pole vaulting seriously from ages 14-25. If you need a binary check on mental or physical preparedness for action, there's no better way than grabbing a 15' fiberglass stick, running full speed, and jumping in the air with it. Also, for a sport this technical, the only way to succeed is to practice in some capacity every single day.",
            "<b>Extended backcountry trips (such as NOLS).</b> When it starts snowing at 10,000 feet in August, you're 4 miles from where you thought you would camp, and your friend goes hypothermic, you can't just open Netflix or smoke weed and expect your problems to go away",
            "<b>Work at several early-stage startups.</b> Long hours with the same people making big decisions with employees' jobs on the line",
            "<b>Research into the body's neurotransmitters and specifically, the peculiarities of my own body</b> (e.g. caffeine sensitivity, how my physical posture or breathing affects my mental state, etc.)"
          ]
        },
        {
          "name": "Communication",
          "experience": [
              "<b>Competitive team sports.</b> Track is a team sport at MIT, and communication between members of the 100+ person multigendered team is critical to success",
              "<b>Conscious practice and self-conscious beginnings.</b> The American media taught me early on that smart people were socially awkward, so for many years that I believed I needed to work twice as hard on my social skills as those around me. Then I realized that most people never consciously practice these incredibly important, learnable skills, which to me is such a shame.",
              "<b>Deep relationships.</b> In my view, our relationships are all we really have in this world. I treat them as more important than any physical posession or skill I could have.",
              "<b>Working with teams of different sizes, in different settings.</b> College was a team sport. At MIT, the classes are so hard you can't do them alone. And my time spent living with 20 of my closest friends in a fraternity brought to light human-to-human dynamics in their most visceral form."
          ]
        },
        {
          "name": "Strategic, Big Picture Thinking & Delayed Gratification",
          "experience": [
            "<b>Natural inclinations.</b> Throughout my life I have lived more in the future than in the present. Zen helps bring me back, but my time in the future has given me lots of practice in the art of planning.",
            "<b>Conscious practice.</b> I've read too many nonfiction books about how to live right now so that my life in some future time is according to how I visualize it to be.",
            "<b>Training in the Zen tradition.</b> Each little detail in each moment is the same as every other detail in every other moment. And yet, we diligently practice to attain Enlightenment",
            "<b>Training for track meets a year in advance.</b> The workouts must evolve, the mental and physical routines must get burned into habits. The pain endured in November is tolerated because of the flow state reached in June",
            "<b>Intermittent fasting.</b> I do this mostly for the long-term health benefits, but it's also an excellent device to practice divorcing myself from short-term craving"
          ]
        },
        {
          "name": "Deep knowledge about physical health",
          "experience": [
            "<b>Pole vaulting:</b> our MIT program approached training as scientifically as possible. My deep relationship with my coaches, Brooks Morris in high school and Dr. Patrick Barragan in college (who holds a Ph.D. in robotics from MIT), instilled in me a fascination for the body's response to training inputs.",
            "<b>Dietary and supplementation research.</b> I spend a lot of time researching what is at the scientific cutting edge of health. Initially I wanted to optimize my training for pole vaulting. I also had serious gut issues that I completely resolved through dietary changes",
            "<b>Consistent yoga practice, myofascial release and posture awareness.</b> Deeply inspired by Kelly Starrett at Mobility Wod for demonstrating the dangers of sitting and lots of creative techniques to heal from injuries and mobilize the body." ,
            "<b>Familial ties.</b> My parents are both doctors (fertility & cardiology). They didn't convince me to follow in their footsteps, but enough dinner table conversations rubbed off on me."
          ]
        }
      ]
    },


    { "name": "Experience (Non-Technical)", "url": "/non-technical-experience", "visible": true,
      "items": [{
          "name": "10-day Vipassana Retreat",
          "image": "/vipassana.png",
          "date": "October 2018",
          "location": "Yangon, Myanmar",
          "description": "Totally silent, 11 hours of meditation each day. Profound insights and 'ego-less' experiences. Mixed reviews about Vipassana as its organized and as a technique/philosophy: blog post coming shortly."
        },
        {
          "name": "Zen YMJJ Retreats",
          "image": "/kwanum.jpeg",
          "date": "Several since 2016",
          "location": "",
          "description": "Silent Buddhist retreats in the Korean Kwan Um Zen tradition. Deep discoveries about myself, the mind, the world, and the nature of knowledge. The Way/path/process is (always) ongoing. Ask me more if you're curious."
        },
        {
          "name": "National Outdoor Leadership School",
          "image": "/nols.png",
          "date": "Summer 2009",
          "location": "Wind River Range, WY",
          "description": "30 day backpacking trip in extremely remote part of the Rockies. No trails, navigated using topo maps. Carried food for 10 days and met twice at planned sites for food rerations."
        }]
    },
    { "name": "Awards (Technical)", "url": "/technical-awards", "visible": true,
      "items": [{
          "name": "2014 MIT EECS Northern Telecom/BNR Project Award for Best Undergraduate Laboratory Project",
          "image": "/eecs.png",
          "for": "6.111 Final Project: Gesture Controlled Drone"
        },
        {
          "name": "2017 AI Grant Finalist",
          "image": "/aigrant.png",
          "for": "Lil Neuron"
        }]
    },
    { "name": "Awards (Non-Technical)", "url": "/non-technical-awards", "visible": true,
      "items": [{
          "name": "2014 CoSida Academic All-American",
          "image": "/cosida.jpg",
          "description": "FIND MORE INFO ON THIS"
        },
        {
          "name": "2014 NCAA Outdoor Track & Field All-American",
          "image": "/ncaa.png",
          "description": "Placed in top 8 in the pole vault at NCAA D3 indoor nationals"
        },
        {
          "name": "2014 NCAA Indoor Track & Field All-American",
          "image": "/ncaa.png",
          "description": "Placed in top 8 in the pole vault at NCAA D3 outdoor nationals"
        }]
    },


    { "name": "Habits", "url": "/habits", "visible": true,
      "items": [{
          "name": "Meditation",
          "reason": "Too many. Getting rid of 'reason', getting rid of 'I', helping me sleep, discovering reality as it is. How people can get by in the world who <i>don't</i> meditate is a mystery to me.",
          "description": "30 minutes, sitting on a cushion or on a pillow, hands folded near my navel.",
          "repetition": "2x per day"
        },
        {
          "name": "Vinyasa Stretching",
          "reason": "Get the blood flowing, put my awareness into my body, check in to see if any injuries",
          "description": "2-3 passes of a standard yogic Vinyasa flow (1-2 minutes)",
          "repetition": "Every morning before meditation"
        },
        {
          "name": "Cold Shower",
          "reason": "Takes me out of my ego for a bit and reminds me that pain is made up by the mind. Wakes me up. Trains my capillaries to deal with cold. Let's me flow with the seasons a bit, as the water temperature is a lot colder in the winter.",
          "description": "No heat, fairly quick (2 min or less)",
          "repetition": "Every morning after meditation"
        },
        {
          "name": "Posture Repositioning",
          "reason": "Staying in one position (especially a bad one) for a long time leads to long-term health problems",
          "description": "When working, I stand or lean in many different variants, and take 'mobility breaks' to move around. If I notice my back slumping or my neck hanging, I go through a 'bracing sequence' (ADD LINK TO KSTAR YT VID) to correct my posture",
          "repetition": "When working, every few minutes. Otherwise, whenever I notice my posture should be fixed or changed."
        },
        {
          "name": "Working Out",
          "reason": "Physical health, stress management, mental health.",
          "description": "I try to be actively training for some goal, and that will determine the workouts I do. But whatever it is, I try to go as hard as my body and mind will take me.",
          "repetition": "At least once a day"
        },
        {
          "name": "Brushing Teeth & Flossing",
          "reason": "This is ridiculous...why is this jerk putting this on his portfolio? I see these two activities as incredibly important. They are totally monotonous, neither fun nor painful. Yet their regularity reminds me of all the other things I must do to sustain my own ability to live each day.",
          "description": "I close my eyes when I brush my teeth, and focus all my energy on accessing every part of my mouth in sequence. When I floss, I hit the spacing between every tooth twice.",
          "repetition": "2x per day (brushing); 1x per day (flossing)"
        }]
    }
  ]
}
